#### BuiltInFailures.KeyBasedTreeEntryFailures Members

---

|  |
| --- |
| BuiltInFailures KeyBasedTreeEntryFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures KeyBasedTreeEntryFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | BadClassificationLevel | Level [Level] of Classification [Code] is not an integer from 1 to 5. |
| Public property Static member | CircularParentage | A sub-[EntryType] '[Code]' specified as parent for its current ancestor '[Code]' |
| Public property Static member | DuplicateEntry | Duplicate code '[Code]', description: '[Description]' |
| Public property Static member | MissingParent | No parent [EntryType] '[Code]' for '[Code]' |

# See Also

BuiltInFailures KeyBasedTreeEntryFailures Class

Autodesk.Revit.DB Namespace